---
title: Transaction
classe: Autodesk.Revit.DB.Transaction
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 15
---

# Transaction

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `transaction.IsValidObject` | Boolean |
| `TransactionStatus Commit(FailureHandlingOptions)` | `transaction.Commit(options)` | TransactionStatus |
| `TransactionStatus Commit()` | `transaction.Commit()` | TransactionStatus |
| `Void Dispose()` | `transaction.Dispose()` | Void |
| `FailureHandlingOptions GetFailureHandlingOptions()` | `transaction.GetFailureHandlingOptions()` | FailureHandlingOptions |
| `String GetName()` | `transaction.GetName()` | String |
| `TransactionStatus GetStatus()` | `transaction.GetStatus()` | TransactionStatus |
| `Boolean HasEnded()` | `transaction.HasEnded()` | Boolean |
| `Boolean HasStarted()` | `transaction.HasStarted()` | Boolean |
| `TransactionStatus RollBack(FailureHandlingOptions)` | `transaction.RollBack(options)` | TransactionStatus |
| `TransactionStatus RollBack()` | `transaction.RollBack()` | TransactionStatus |
| `Void SetFailureHandlingOptions(FailureHandlingOptions)` | `transaction.SetFailureHandlingOptions(options)` | Void |
| `Void SetName(String)` | `transaction.SetName(name)` | Void |
| `TransactionStatus Start(String)` | `transaction.Start(name)` | TransactionStatus |
| `TransactionStatus Start()` | `transaction.Start()` | TransactionStatus |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```